In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
import seaborn as sns
import sqlite3
import mysql.connector as cnt
import plotly.express as px

In [2]:
# Turite nusiskaityti iš SQL DB lentelės autopliuslt į Pandas DataFrame gamintoją, kainą, 
# pagaminimo datą, ridą, pavarų tipą, variklio informaciją. SQL užklausoje turite atmesti 
# tuos įrašus, kur rida nenurodyta, taip pat palikite tik nesikartojančius įrašus 
# (atranka pagal ID stuleplį - jei ID sutampa - reiškia, jog skelbimas dubliuojasi)

#prisijungimas prie mySQL, ir kursoriaus sukūrimas
DB = cnt.connect(
host = '88.223.121.130',
user='user',
password='slaptazodis',
port=3306,
database='works'
)
C=DB.cursor()

#sql užklausa per pandas sql_query
sql="""SELECT DISTINCT id, gamintojas as G, price as K, pagaminimo_data as M, rida as R, pavaros as P, variklis as V
FROM autopliuslt
WHERE rida <> 'Nenurodyta'
GROUP BY id;"""
df = pd.read_sql_query(sql, con=DB)      #sql - uzklausa kurioje vykdome, DB - prie ko jungiames.
df.head()



# pavarų tipą

            id              G      K     M           R           P         V
0  ID:-3364605     Mitsubishi  1 450  1996  173 810 km   Mechaninė  2500 cm³
1  ID:-4204538          Isuzu    850  2003  186 684 km   Mechaninė  3000 cm³
2  ID:-4239068        Hyundai  1 450  2004  159 326 km   Mechaninė  2400 cm³
3  ID:-7738901         Toyota  1 450  2008  249 449 km   Mechaninė  2200 cm³
4  ID:-7821845  Mercedes-Benz  1 450  2003  205 997 km  Automatinė  2700 cm³